; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l30_p30_c30_g30)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 refugio30 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 person30 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-box box30 deposito)
	(box-has box30 medicina)
	(at-person person1 refugio17)
	(at-person person2 refugio30)
	(at-person person3 refugio2)
	(at-person person4 refugio4)
	(at-person person5 refugio13)
	(at-person person6 refugio14)
	(at-person person7 refugio22)
	(at-person person8 refugio5)
	(at-person person9 refugio20)
	(at-person person10 refugio4)
	(at-person person11 refugio1)
	(at-person person12 refugio10)
	(at-person person13 refugio5)
	(at-person person14 refugio8)
	(at-person person15 refugio18)
	(at-person person16 refugio24)
	(at-person person17 refugio13)
	(at-person person18 refugio29)
	(at-person person19 refugio18)
	(at-person person20 refugio5)
	(at-person person21 refugio10)
	(at-person person22 refugio25)
	(at-person person23 refugio22)
	(at-person person24 refugio10)
	(at-person person25 refugio14)
	(at-person person26 refugio20)
	(at-person person27 refugio5)
	(at-person person28 refugio25)
	(at-person person29 refugio12)
	(at-person person30 refugio5)
)

(:goal (and
	(person-has person1 medicina)
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person5 medicina)
	(person-has person7 comida)
	(person-has person7 medicina)
	(person-has person8 comida)
	(person-has person9 comida)
	(person-has person10 comida)
	(person-has person10 medicina)
	(person-has person13 comida)
	(person-has person14 medicina)
	(person-has person16 comida)
	(person-has person16 medicina)
	(person-has person17 comida)
	(person-has person18 medicina)
	(person-has person19 comida)
	(person-has person19 medicina)
	(person-has person20 medicina)
	(person-has person21 medicina)
	(person-has person23 comida)
	(person-has person23 medicina)
	(person-has person25 comida)
	(person-has person26 comida)
	(person-has person27 comida)
	(person-has person27 medicina)
	(person-has person29 comida)
	(person-has person30 medicina)
))
)

; plan
1. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 0 of 30
2. (pick box30 deposito dron1-izq dron1)
   deleted: (at-box box30 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box30)
   goals met: 0 of 30
3. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 0 of 30
4. (leave box30 refugio17 dron1-izq dron1 person1 medicina)
   deleted: (carrying dron1 dron1-izq box30) (box-has box30 medicina)
   added: (at-box box30 refugio17) (free dron1-izq) (person-has person1 medicina)
   goals met: 1 of 30
5. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 1 of 30
6. (pick box29 deposito dron1-izq dron1)
   deleted: (at-box box29 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box29)
   goals met: 1 of 30
7. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 1 of 30
8. (move refugio30 refugio8 dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 refugio8)
   goals met: 1 of 30
9. (leave box29 refugio8 dron1-izq dron1 person14 medicina)
   deleted: (carrying dron1 dron1-izq box29) (box-has box29 medicina)
   added: (at-box box29 refugio8) (free dron1-izq) (person-has person14 medicina)
   goals met: 2 of 30
10. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 2 of 30
11. (pick box28 deposito dron1-izq dron1)
   deleted: (at-box box28 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box28)
   goals met: 2 of 30
12. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 2 of 30
13. (move refugio30 refugio29 dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 refugio29)
   goals met: 2 of 30
14. (leave box28 refugio29 dron1-izq dron1 person18 medicina)
   deleted: (carrying dron1 dron1-izq box28) (box-has box28 medicina)
   added: (at-box box28 refugio29) (free dron1-izq) (person-has person18 medicina)
   goals met: 3 of 30
15. (move refugio29 deposito dron1)
   deleted: (at-dron dron1 refugio29)
   added: (at-dron dron1 deposito)
   goals met: 3 of 30
16. (pick box27 deposito dron1-izq dron1)
   deleted: (at-box box27 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box27)
   goals met: 3 of 30
17. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 3 of 30
18. (move refugio30 refugio10 dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 refugio10)
   goals met: 3 of 30
19. (leave box27 refugio10 dron1-izq dron1 person21 medicina)
   deleted: (carrying dron1 dron1-izq box27) (box-has box27 medicina)
   added: (at-box box27 refugio10) (free dron1-izq) (person-has person21 medicina)
   goals met: 4 of 30
20. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 4 of 30
21. (pick box26 deposito dron1-izq dron1)
   deleted: (at-box box26 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box26)
   goals met: 4 of 30
22. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 4 of 30
23. (move refugio30 refugio14 dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 refugio14)
   goals met: 4 of 30
24. (leave box15 refugio14 dron1-der dron1 person25 comida)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 comida)
   added: (at-box box15 refugio14) (free dron1-der) (person-has person25 comida)
   goals met: 5 of 30
25. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 5 of 30
26. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 5 of 30
27. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 5 of 30
28. (move refugio30 refugio12 dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 refugio12)
   goals met: 5 of 30
29. (leave box14 refugio12 dron1-der dron1 person29 comida)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 comida)
   added: (at-box box14 refugio12) (free dron1-der) (person-has person29 comida)
   goals met: 6 of 30
30. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 6 of 30
31. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 6 of 30
32. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 6 of 30
33. (leave box13 refugio30 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 comida)
   added: (at-box box13 refugio30) (free dron1-der) (person-has person2 comida)
   goals met: 7 of 30
34. (move refugio30 deposito dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 deposito)
   goals met: 7 of 30
35. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 7 of 30
36. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 7 of 30
37. (leave box26 refugio30 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box26) (box-has box26 medicina)
   added: (at-box box26 refugio30) (free dron1-izq) (person-has person2 medicina)
   goals met: 8 of 30
38. (move refugio30 deposito dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 deposito)
   goals met: 8 of 30
39. (pick box25 deposito dron1-izq dron1)
   deleted: (at-box box25 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box25)
   goals met: 8 of 30
40. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 8 of 30
41. (leave box12 refugio4 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio4) (free dron1-der) (person-has person4 comida)
   goals met: 9 of 30
42. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 9 of 30
43. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 9 of 30
44. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 9 of 30
45. (leave box25 refugio4 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box25) (box-has box25 medicina)
   added: (at-box box25 refugio4) (free dron1-izq) (person-has person4 medicina)
   goals met: 10 of 30
46. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 10 of 30
47. (pick box24 deposito dron1-izq dron1)
   deleted: (at-box box24 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box24)
   goals met: 10 of 30
48. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 10 of 30
49. (leave box11 refugio4 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio4) (free dron1-der) (person-has person10 comida)
   goals met: 11 of 30
50. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 11 of 30
51. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 11 of 30
52. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 11 of 30
53. (leave box24 refugio4 dron1-izq dron1 person10 medicina)
   deleted: (carrying dron1 dron1-izq box24) (box-has box24 medicina)
   added: (at-box box24 refugio4) (free dron1-izq) (person-has person10 medicina)
   goals met: 12 of 30
54. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 12 of 30
55. (pick box23 deposito dron1-izq dron1)
   deleted: (at-box box23 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box23)
   goals met: 12 of 30
56. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 12 of 30
57. (leave box10 refugio24 dron1-der dron1 person16 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio24) (free dron1-der) (person-has person16 comida)
   goals met: 13 of 30
58. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 13 of 30
59. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 13 of 30
60. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 13 of 30
61. (leave box23 refugio24 dron1-izq dron1 person16 medicina)
   deleted: (carrying dron1 dron1-izq box23) (box-has box23 medicina)
   added: (at-box box23 refugio24) (free dron1-izq) (person-has person16 medicina)
   goals met: 14 of 30
62. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 14 of 30
63. (pick box22 deposito dron1-izq dron1)
   deleted: (at-box box22 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box22)
   goals met: 14 of 30
64. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 14 of 30
65. (leave box22 refugio13 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box22) (box-has box22 medicina)
   added: (at-box box22 refugio13) (free dron1-izq) (person-has person5 medicina)
   goals met: 15 of 30
66. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 15 of 30
67. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 15 of 30
68. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 15 of 30
69. (leave box9 refugio13 dron1-der dron1 person17 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio13) (free dron1-der) (person-has person17 comida)
   goals met: 16 of 30
70. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 16 of 30
71. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 16 of 30
72. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 16 of 30
73. (leave box8 refugio18 dron1-der dron1 person19 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio18) (free dron1-der) (person-has person19 comida)
   goals met: 17 of 30
74. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 17 of 30
75. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 17 of 30
76. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 17 of 30
77. (leave box21 refugio18 dron1-izq dron1 person19 medicina)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 medicina)
   added: (at-box box21 refugio18) (free dron1-izq) (person-has person19 medicina)
   goals met: 18 of 30
78. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 18 of 30
79. (pick box20 deposito dron1-izq dron1)
   deleted: (at-box box20 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box20)
   goals met: 18 of 30
80. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 18 of 30
81. (leave box7 refugio22 dron1-der dron1 person7 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio22) (free dron1-der) (person-has person7 comida)
   goals met: 19 of 30
82. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 19 of 30
83. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 19 of 30
84. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 19 of 30
85. (leave box20 refugio22 dron1-izq dron1 person7 medicina)
   deleted: (carrying dron1 dron1-izq box20) (box-has box20 medicina)
   added: (at-box box20 refugio22) (free dron1-izq) (person-has person7 medicina)
   goals met: 20 of 30
86. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 20 of 30
87. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 20 of 30
88. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 20 of 30
89. (leave box6 refugio22 dron1-der dron1 person23 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio22) (free dron1-der) (person-has person23 comida)
   goals met: 21 of 30
90. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 21 of 30
91. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 21 of 30
92. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 21 of 30
93. (leave box19 refugio22 dron1-izq dron1 person23 medicina)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 medicina)
   added: (at-box box19 refugio22) (free dron1-izq) (person-has person23 medicina)
   goals met: 22 of 30
94. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 22 of 30
95. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 22 of 30
96. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 22 of 30
97. (leave box5 refugio20 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio20) (free dron1-der) (person-has person9 comida)
   goals met: 23 of 30
98. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 23 of 30
99. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 23 of 30
100. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 23 of 30
101. (leave box4 refugio20 dron1-der dron1 person26 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio20) (free dron1-der) (person-has person26 comida)
   goals met: 24 of 30
102. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 24 of 30
103. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 24 of 30
104. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 24 of 30
105. (leave box3 refugio5 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio5) (free dron1-der) (person-has person8 comida)
   goals met: 25 of 30
106. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 25 of 30
107. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 25 of 30
108. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 25 of 30
109. (leave box2 refugio5 dron1-der dron1 person13 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio5) (free dron1-der) (person-has person13 comida)
   goals met: 26 of 30
110. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 26 of 30
111. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 26 of 30
112. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 26 of 30
113. (leave box1 refugio5 dron1-der dron1 person27 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio5) (free dron1-der) (person-has person27 comida)
   goals met: 27 of 30
114. (leave box18 refugio5 dron1-izq dron1 person20 medicina)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 medicina)
   added: (at-box box18 refugio5) (free dron1-izq) (person-has person20 medicina)
   goals met: 28 of 30
115. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 28 of 30
116. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 28 of 30
117. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 28 of 30
118. (leave box17 refugio5 dron1-der dron1 person27 medicina)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 medicina)
   added: (at-box box17 refugio5) (free dron1-der) (person-has person27 medicina)
   goals met: 29 of 30
119. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 29 of 30
120. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 29 of 30
121. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 29 of 30
122. (leave box16 refugio5 dron1-der dron1 person30 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio5) (free dron1-der) (person-has person30 medicina)
   goals met: 30 of 30
